[
  {
    "title": "Divisional Round",
    "week": "Divisional Round",
    "date": "1/17 (Sunday)",
    "time": "10:05 a.m.",
    "location": "Charlotte",
    "finalwinner": "Panthers 31",
    "finalloser": "Seahawks 24",
    "ot": "",
    "condottascore": "24-21 Panthers",
    "condottacommentary": "<p>Doubts remain about the Panthers despite a 15-1 season. The Seahawks, meanwhile, finished the regular season with a flourish. Still, though the Seahawks have the experience and pedigree, the Panthers have the home field and the feeling that this might just be their year.</p>",
    "condottaclosest": "x",
    "jenksscore": "21-17 Seahawks",
    "jenkscommentary": "<p>Out of the teams Panthers QB Cam Newton has faced at least three times in his career, the Seahawks have held Newton to his lowest completion percentage and fewest yards per game. Even in Carolina's win this season, Newton completed only 56 percent of his passes (his third-lowest percentage this year) and threw two interceptions. In other words, the Seahawks have generally had his number.</p>",
    "jenksclosest": "",
    "stonescore": "30-27 Seahawks",
    "stonecommentary": "<p>This will be a knock-down, drag-out battle, because that's what the Seahawks and Panthers do. And it should go down to the wire, because that's what the Seahawks do in the playoffs. It will be decided by a Steven Hauschka field goal &mdash; and unlike Blair Walsh, he'll nail it.</p>",
    "stoneclosest": "",
    "calkinsscore": "24-23 Panthers",
    "calkinscommentary": "<p>This is as close to a pick-'em as you get. But with the home-field advantage, I give the slight edge to a Carolina team that's stacked on both sides of the ball.</p>",
    "calkinsclosest": "",
    "celebscore": "24-17 Seahawks",
    "celebcommentary": "<p>I think Russell Wilson is playing really well right now, and the Seahawks' run defense has been so good lately. I think they're just gonna man up.</p>",
    "celebname": "Sigi Schmid",
    "celebbio": "Head coach, Seattle Sounders FC",
    "celebclosest": "",
    "celeb2score": "",
    "celeb2commentary": "",
    "celeb2name": "",
    "celeb2bio": "",
    "celeb2closest": ""
  },
  {
    "title": "Wild-Card Round",
    "week": "Wild-Card Round",
    "date": "1/10 (Sunday)",
    "time": "10:05 a.m.",
    "location": "Minneapolis",
    "finalwinner": "Seahawks 10",
    "finalloser": "Vikings 9",
    "ot": "",
    "condottascore": "23-6 Seahawks",
    "condottacommentary": "<p>It seems unlikely this game will be as easy as Seattle's first trip to Minnesota this season, a 38-7 win on Dec. 6. The Vikings figure to be more committed to getting Adrian Peterson the ball and getting the running game going. And they should be healthier on defense, especially in the secondary. But given the Seahawks finished the season with the No. 1 ranked run defense, and given what we saw earlier this season, this just seems like a good matchup for the Seahawks and another likely decisive win.</p>",
    "condottaclosest": "",
    "jenksscore": "28-24 Seahawks",
    "jenkscommentary": "<p>This one should be closer than the first time around. The Vikings want to run the ball. They want to play good defense. They have a young quarterback. It all sounds very much like the Seahawks, which is sort of the point I'm getting at: It is hard to out-Seahawks the Seahawks, which is why I think Seattle will win.</p>",
    "jenksclosest": "",
    "stonescore": "24-17 Seahawks",
    "stonecommentary": "<p>The weather may be the great equalizer. It seems to me that temperatures approaching zero favor a running team, and the Vikings have the league's rushing leader in Adrian Peterson. On the other hand, the Seahawks held Peterson to 18 yards on eight carries in their 38-7 win over Minnesota earlier in the year. Seattle's defense will once again be the difference.</p>",
    "stoneclosest": "x",
    "calkinsscore": "24-14 Seahawks",
    "calkinscommentary": "<p>The Vikings got a wake-up call after the Seahawks smashed them last time, but that won't be enough for Minnesota to beat a superior team. Seattle will advance.</p>",
    "calkinsclosest": "",
    "celebscore": "24-16 Seahawks",
    "celebcommentary": "<p>Seahawks will go into the fourth quarter down three points and they will win. I've already checked the future and that's what happens. I've always had hunches with them.</p>",
    "celebname": "Sir Mix-A-Lot",
    "celebbio": "Seattle rapper",
    "celebclosest": "",
    "celeb2score": "24-10 Seahawks",
    "celeb2commentary": "<p>I’m basing my prediction off of my personal knowledge of the Seahawks defense, which will win the game.</p>",
    "celeb2name": "Chad Smith",
    "celeb2bio": "Drummer, Red Hot Chili Peppers",
    "celeb2closest": ""
  },
  {
    "title": "Week 17",
    "week": "Week 17",
    "date": "1/3 (Sunday)",
    "time": "1:25 p.m.",
    "location": "Glendale",
    "finalwinner": "Seahawks 36",
    "finalloser": "Cardinals 6",
    "ot": "",
    "condottascore": "28-17 Cardinals",
    "condottacommentary": "<p>This game has sort of a weird setup, with neither team knowing for sure at kickoff if it has anything to play for. That makes it a little hard to read from the outside. Assuming they play straight-up, the Cardinals loom as a tough matchup for the Seahawks. Seattle has uncharacteristically struggled this year against good quarterbacks, and in Arizona may be facing the best QB-receiver group in the NFL.</p>",
    "condottaclosest": "",
    "jenksscore": "27-24 Cardinals",
    "jenkscommentary": "<p>The great unknown is whether the Cardinals will play their starters and for how long. But at full strength, Arizona's full offense is perhaps the most dangerous group in the league. Consider this: The Cardinals have more touchdowns than punts this year.</p>",
    "jenksclosest": "",
    "stonescore": "23-20 Cardinals",
    "stonecommentary": "<p>Last week's loss to the Rams wiped out &mdash; at least temporarily &mdash; the Seahawks' feel-good narrative. They'd love to go into the playoffs riding a victory, but if the Cardinals play to win &mdash; as they should &mdash; that's a daunting task for Seattle on the road.</p>",
    "stoneclosest": "",
    "calkinsscore": "35-24 Cardinals",
    "calkinscommentary": "<p>The Cardinals are at home, healthy and could be playing for a No. 1 seed. Seattle will go into the playoffs at 9-7.</p>",
    "calkinsclosest": "",
    "celebscore": "20-17 Seahawks",
    "celebcommentary": "<p>The Seahawks will bounce back from the loss to the Rams by beating the Cardinals. Steven Hauschka will kick a last-second field goal to win the game, allowing Seattle to finish the season and go into the playoffs on a high note. Go Hawks!</p>",
    "celebname": "Rick Rizzs",
    "celebbio": "Mariners radio announcer",
    "celebclosest": "x",
    "celeb2score": "",
    "celeb2commentary": "",
    "celeb2name": "",
    "celeb2bio": "",
    "celeb2closest": ""
  },
  {
    "title": "Week 16",
    "week": "Week 16",
    "date": "12/27 (Sunday)",
    "time": "1:25 p.m.",
    "location": "Seattle",
    "finalwinner": "Rams 23",
    "finalloser": "Seahawks 17",
    "ot": "",
    "condottascore": "24-9 Seahawks",
    "condottacommentary": "<p>The annual late-season visit by the Rams sees them again ending a disappointing season. But the Rams' defensive front always seems to give the Seahawks some issues and this will be an interesting test of Seattle's new-look running game. The Seahawks will get the job done, but there could be some tense moments early.</p>",
    "condottaclosest": "",
    "jenksscore": "27-13 Seahawks",
    "jenkscommentary": "<p>The real questions surrounding the game are whether Russell Wilson will throw at least three touchdowns and no interceptions for the sixth-straight game, and whether Doug Baldwin will catch at least two touchdown passes in his fifth consecutive game.</p>",
    "jenksclosest": "",
    "stonescore": "30-21 Seahawks",
    "stonecommentary": "<p>The Rams always seem to play the Seahawks tough, and they have a win over Seattle in the season opener. But the Seahawks are a much different team now, and are on a big-time roll. They're not going to let this one slip away.</p>",
    "stoneclosest": "",
    "calkinsscore": "24-10 Seahawks",
    "calkinscommentary": "<p>The Seahawks' offense should continue to roll, and the defense will do enough against a Rams team lacking a potent enough offense to do any real damage.</p>",
    "calkinsclosest": "",
    "celebscore": "39-9 Seahawks",
    "celebcommentary": "<p>The farther I am away from the stadium, the better the Hawks do. The curse is strong in me. So Sunday I am in Bellingham.</p>",
    "celebname": "Marty Reimer",
    "celebbio": "Morning host, KJR 95.7 The Jet",
    "celebclosest": "",
    "celeb2score": "",
    "celeb2commentary": "",
    "celeb2name": "",
    "celeb2bio": "",
    "celeb2closest": ""
  },
  {
    "title": "Week 15",
    "week": "Week 15",
    "date": "12/20 (Sunday)",
    "time": "1:05 p.m.",
    "location": "Seattle",
    "finalwinner": "Seahawks 30",
    "finalloser": "Browns 13",
    "ot": "",
    "condottascore": "34-9 Seahawks",
    "condottacommentary": "<p>Cleveland is coming off of its best game of the season in routing the 49ers last Sunday, and might come into Seattle with a little renewed confidence. But the Browns remain one of the worst teams in the NFL and have a quarterback in Johnny Manziel making just the seventh start of his career. Seattle's uncertain running back situation shouldn't matter in this one.</p>",
    "condottaclosest": "",
    "jenksscore": "27-10 Seahawks",
    "jenkscommentary": "<p>There are a number of ways to say the Seahawks will win this game, but here are the most obvious ones: The Browns are tied for the worst record in the league, the Seahawks have won four-straight and the game is being played in Seattle. This is as close to a sure win as the Seahawks have had all year.</p>",
    "jenksclosest": "x",
    "stonescore": "35-10 Seahawks",
    "stonecommentary": "<p>The Seahawks could beat the Browns with one running back tied behind their back. Marshawn Lynch is gone, Thomas Rawls is out for the season and the position is unsettled, but it should hardly matter. Seattle's passing attack is purring, its defense is back on track and the Browns simply aren't a very good team.</p>",
    "stoneclosest": "",
    "calkinsscore": "24-7 Seahawks",
    "calkinscommentary": "<p>The absence of Thomas Rawls may have an effect on Russell Wilson's passing game, which could prevent him from having another astronomical game. But the Seahawks still overmatch the Browns in every phase of the game and should win handily.</p>",
    "calkinsclosest": "",
    "celebscore": "34-3 Seahawks",
    "celebcommentary": "<p>The bad parts are behind the Seahawks. It was always a 16-game schedule &mdash; which they knew. I would give the points, if that's what you're really asking. (The spread is 14.)</p>",
    "celebname": "Kenny Mayne",
    "celebbio": "ESPN 'SportsCenter' anchor",
    "celebclosest": "",
    "celeb2score": "",
    "celeb2commentary": "",
    "celeb2name": "",
    "celeb2bio": "",
    "celeb2closest": ""
  },
  {
    "title": "Week 14",
    "week": "Week 14",
    "date": "12/13 (Sunday)",
    "time": "10 a.m.",
    "location": "Baltimore",
    "finalwinner": "Seahawks 35",
    "finalloser": "Ravens 6",
    "ot": "",
    "condottascore": "27-13 Seahawks",
    "condottacommentary": "<p>Seattle is hitting its stride while the Ravens are playing out the string on what has been a disappointing and injury-riddled season. Baltimore's QB situation remained uncertain as the week began with Matt Schaub battling some injuries, with the possibility that the team could be forced to use recently acquired Jimmy Clausen. Baltimore's defense could make this one more difficult than last week, but the Seahawks should win going away.</p>",
    "condottaclosest": "",
    "jenksscore": "27-10 Seahawks",
    "jenkscommentary": "<p>Seahawks coach Pete Carroll spent the week talking about the quality of the Ravens, and it is true that Baltimore has lost all of its games by eight points or fewer. But the Seahawks are clicking, quarterback Russell Wilson and the offense have never looked better, and the Ravens will rely on a backup quarterback. No matter how close the Ravens have played teams, the Seahawks should roll.</p>",
    "jenksclosest": "",
    "stonescore": "35-10 Seahawks",
    "stonecommentary": "<p>Baltimore is the best 4-8 team in the NFL &mdash; they've yet to lose by more than eight points &mdash; but it's hard to see them holding that tough against the resurgent Seahawks, who are peaking on both sides of the ball. Especially not if Jimmy Clausen ends up starting at quarterback for Baltimore, or splitting time with banged-up Matt Schaub. The Seahawks will make him look just as bad as they did when he started against them for Chicago earlier this year.</p>",
    "stoneclosest": "x",
    "calkinsscore": "28-10 Seahawks",
    "calkinscommentary": "<p>The Ravens are probably a little better than their record indicates, but the Seahawks have looked like one of the NFL's best teams lately. Look for another runaway win in Baltimore.</p>",
    "calkinsclosest": "",
    "celebscore": "29-21 Seahawks",
    "celebcommentary": "<p>My favorite part of any Seahawks game is when it’s over and both teams are on the field saying hi and hugging &mdash; I like to pretend that they all end up going out for beers and pizza. So, I predict the Hawks win by eight and, because they feel sorry for the Baltimore Ravens, they buy the first round at Chuck E. Cheese's.</p>",
    "celebname": "Nancy Guppy",
    "celebbio": "Host of Seattle Channel's 'Art Zone'",
    "celebclosest": "",
    "celeb2score": "",
    "celeb2commentary": "",
    "celeb2name": "",
    "celeb2bio": "",
    "celeb2closest": ""
  },
  {
    "title": "Week 13",
    "week": "Week 13",
    "date": "12/6 (Sunday)",
    "time": "10 a.m.",
    "location": "Minneapolis",
    "finalwinner": "Seahawks 38",
    "finalloser": "Vikings 7",
    "ot": "",
    "condottascore": "21-16 Seahawks",
    "condottacommentary": "<p>This looms as a much tougher game for the Seahawks than it appeared when the season began, with Minnesota now standing 8-3. The Vikings have a tough defense and a great running game led by Adrian Peterson. But they should tax the Seattle secondary the way other recent teams have, and the Seahawks' offense also seems to be hitting its stride at the right time. The Seahawks will escape with a win that could go a long way toward securing a playoff spot.</p>",
    "condottaclosest": "",
    "jenksscore": "24-20 Vikings",
    "jenkscommentary": "<p>Adrian Peterson is right back in form and leading the NFL in rushing, and the Vikings' defense has been dominant at times. The Vikings should win their division and the Seahawks are 2-3 on the road this season.</p>",
    "jenksclosest": "",
    "stonescore": "23-20 Seahawks",
    "stonecommentary": "<p>Their victory over the Steelers last week should have a galvanizing effect on the Seahawks, despite all the yards they gave up. It was the closest thing we've seen this year to the formula that has carried the Seahawks for the past two years: an opportunistic defense fueling an efficient offense with big-play capability. They should continue on the road against the Vikings.</p>",
    "stoneclosest": "",
    "calkinsscore": "23-20 Vikings",
    "calkinscommentary": "<p>The Seahawks don't have to worry about an elite quarterback picking them apart, but they are playing a first-place team on the road. The Vikings should squeak this out.</p>",
    "calkinsclosest": "",
    "celebscore": "24-17 Seahawks",
    "celebcommentary": "<p>I am in an office pool at work and I pick the same damn score every week. I know one of these weeks my prediction will come true. Go Hawks!</p>",
    "celebname": "Bernadine Griffin",
    "celebbio": "Managing director, 5th Avenue Theatre",
    "celebclosest": "x",
    "celeb2score": "",
    "celeb2commentary": "",
    "celeb2name": "",
    "celeb2bio": "",
    "celeb2closest": ""
  },
  {
    "title": "Week 12",
    "week": "Week 12",
    "date": "11/29 (Sunday)",
    "time": "1:25 p.m.",
    "location": "Seattle",
    "finalwinner": "Seahawks 39",
    "finalloser": "Steelers 30",
    "ot": "",
    "condottascore": "21-20 Seahawks",
    "condottacommentary": "<p>Pittsburgh's passing attack will be a real challenge for the Seahawks, especially with Ben Roethlisberger back and coming off of a bye week. But the Steelers don't have the running threat they previously had with Le'Veon Bell out, and the Seattle defense seems due to get a turnover or two at a critical time. The Seattle offense, meanwhile, appears to run just fine with Thomas Rawls. The Seahawks will get and keep a fourth-quarter lead against a good team this time.</p>",
    "condottaclosest": "",
    "jenksscore": "27-24 Seahawks",
    "jenkscommentary": "<p>The Seahawks have yet to beat a team with a winning record this season, and they have not yet shown that they can hold a lead against a quality team. But I'm going with this as the game when both of those trends change.</p>",
    "jenksclosest": "",
    "stonescore": "24-20 Seahawks",
    "stonecommentary": "<p>The Seahawks haven't yet beaten a quality opponent, but that will change in this game. With Thomas Rawls giving a big boost to the offense and Russell Wilson coming off of his best game of the year, it will come down to Seattle's defense slowing down Ben Roethlisberger and Co. just enough to pull out the victory.</p>",
    "stoneclosest": "",
    "calkinsscore": "21-17 Steelers",
    "calkinscommentary": "<p>The league's best quarterbacks have had their way with the Seahawks this year, and Ben Roethlisberger is in that upper tier. Pittsburgh will squeak this one out.</p>",
    "calkinsclosest": "",
    "celebscore": "27-20 Seahawks",
    "celebcommentary": "<p>I predict a Seattle win because I think the Seahawks' pass rush will get a gimpy Ben Roethlisberger, and because I think Thomas Rawls is the real deal, and because my heart is apparently much bigger than my brain. (I should probably get that looked at.)</p>",
    "celebname": "Luke Burbank",
    "celebbio": "Host of the 'Too Beautiful to Live' podcast",
    "celebclosest": "x",
    "celeb2score": "",
    "celeb2commentary": "",
    "celeb2name": "",
    "celeb2bio": "",
    "celeb2closest": ""
  },
  {
    "title": "Week 11",
    "week": "Week 11",
    "date": "11/22 (Sunday)",
    "time": "1:25 p.m.",
    "location": "Seattle",
    "finalwinner": "Seahawks 29",
    "finalloser": "49ers 13",
    "ot": "",
    "condottascore": "21-9 Seahawks",
    "condottacommentary": "<p>The Seahawks are now at the stage where every game is truly must-win. The good news is that they get one of the worst teams in the NFL coming to Seattle this week. These are not the Harbaugh-era 49ers and QB Blaine Gabbert is not Carson Palmer or Cam Newton. The 49ers defense could make this one look ugly for a while, but the Seahawks will get it done.</p>",
    "condottaclosest": "",
    "jenksscore": "27-10 Seahawks",
    "jenkscommentary": "<p>Despite the final stats, the Seahawks' defense has played well of late and has forced turnovers that either saved points or led directly to points. The 49ers have struggled on offense all season, and the Seahawks should feast.</p>",
    "jenksclosest": "x",
    "stonescore": "30-7 Seahawks",
    "stonecommentary": "<p>It won't prove much, but the Seahawks will release some of their frustration against an over-matched 49ers team. The \"must win\" nature of the game should sufficiently motivate Seattle to bury a 49ers team that is severely challenged on offense.</p>",
    "stoneclosest": "",
    "calkinsscore": "24-7 Seahawks",
    "calkinscommentary": "<p>The Seahawks have struggled offensively this year, but they are going up against a pitiful San Francisco team that is outmatched in every phase of the game.</p>",
    "calkinsclosest": "",
    "celebscore": "19-17 Seahawks",
    "celebcommentary": "<p>I don't care about football. I don't know anything about football. But I know someone who knows and cares: my big brother Billy Savage.</p><p>\"This match between bottom-feeders &mdash; with 3-6 San Francisco hoping to drag 4-5 Seattle down to the same level &mdash; promises great fun for viewers in the Midwest and the East,\" Bill told me. \"When two teams that had playoff aspirations, and recent playoff history, meet in the regular season and both suck, at least you want them to hate each other. So here's looking for an over-under on unnecessary roughness penalties of 4.5. The winning team will be the one with fewer hate-induced penalties.\"</p></p>I haven't the faintest idea what any of that means. Go Hawks!</p>",
    "celebname": "Dan Savage",
    "celebbio": "<em>The Stranger</em> sex columnist",
    "celebclosest": "",
    "celeb2score": "",
    "celeb2commentary": "",
    "celeb2name": "",
    "celeb2bio": "",
    "celeb2closest": ""
  },
  {
    "title": "Week 10",
    "week": "Week 10",
    "date": "11/15 (Sunday)",
    "time": "5:30 p.m.",
    "location": "Seattle",
    "finalwinner": "Cardinals 39",
    "finalloser": "Seahawks 32",
    "ot": "",
    "condottascore": "17-13 Seahawks",
    "condottacommentary": "<p>In what looms as a make-or-break game for the Seahawks to stay in the NFC West race, the home field will help lift Seattle to its first win against a team with a winning record. Arizona can move it all over the field, but in recent games has had trouble turning yards into touchdowns. Expect Seattle to come up with some game-turning defensive stops, and finally get a few turnovers, to get a much-needed win.</p>",
    "condottaclosest": "",
    "jenksscore": "24-20 Cardinals",
    "jenkscommentary": "<p>Under Pete Carroll, the Seahawks have thrived in prime-time games and in the second half of the season &mdash; criteria that this game meets. But the Seahawks have yet to put together a convincing game, and the Cardinals are a good all-around team.</p>",
    "jenksclosest": "x",
    "stonescore": "24-20 Seahawks",
    "stonecommentary": "<p>This is Seattle's biggest game of the season, at least so far, and the Seahawks will pull it out with a fourth-quarter touchdown drive. The players know what is at stake, and more importantly, the consequences of losing this one. They won't let it happen at home.</p>",
    "stoneclosest": "",
    "calkinsscore": "20-17 Cardinals",
    "calkinscommentary": "<p>In their first real test in weeks, the Seahawks will discover they are no longer the class of the division as Arizona squeaks out a win.</p>",
    "calkinsclosest": "",
    "celebscore": "24-14 Seahawks",
    "celebcommentary": "<p>Seattle's defense is coming on and the offensive line is coming together. Home-field advantage is huge! What to watch: quarterback Carson Palmer, receiver Larry Fitzgerald and the Cardinals' pass rush. For the Seahawks, the running game is key to victory!</p>",
    "celebname": "Steve Largent",
    "celebbio": "Seahawks wide receiver, 1976-89",
    "celebclosest": "",
    "celeb2score": "",
    "celeb2commentary": "",
    "celeb2name": "",
    "celeb2bio": "",
    "celeb2closest": ""
  },
  {
    "title": "Week 8",
    "week": "Week 8",
    "date": "11/1 (Sunday)",
    "time": "1:25 p.m.",
    "location": "Arlington",
    "finalwinner": "Seahawks 13",
    "finalloser": "Cowboys 12",
    "ot": "",
    "condottascore": "24-16 Seahawks",
    "condottacommentary": "<p>The Cowboys are 2-4 &mdash; 2-0 with Tony Romo and 0-4 without him. They will again be wthout him Sunday, though they should have WR Dez Bryant back. The real key will be if the Seahawks can stop a Dallas running attack that rivals that of Carolina's and force QB Matt Cassel to have to win it. As long as Seattle takes care of the ball, the Seahawks should have enough to get their first win at Dallas since 2002.</p>",
    "condottaclosest": "",
    "jenksscore": "27-20 Seahawks",
    "jenkscommentary": "<p>Even if Dez Bryant is able to play, the Cowboys still have a glaring question mark at quarterback: Namely, do they have one who can pick apart Seattle's defense? The best guess here is no.</p>",
    "jenksclosest": "",
    "stonescore": "20-10 Seahawks",
    "stonecommentary": "<p>Last year, the Seahawks benefited from playing a number of teams when they had to use backup quarterbacks, and they should this year, too. The Hawks already beat the Bears without Jay Cutler, and on Sunday should be able to handle the Cowboys without Tony Romo. The fact the Cowboys have some controversy swirling around Greg Hardy won't hurt, either.</p>",
    "stoneclosest": "",
    "calkinsscore": "17-10 Seahawks",
    "calkinscommentary": "<p>The Seahawks have proven they can handle bad teams, and without Tony Romo, the Cowboys are just that. Don't expect too much offense from Seattle, but there should be enough to get back to .500.</p>",
    "calkinsclosest": "x",
    "celebscore": "27-16 Seahawks",
    "celebcommentary": "<p>The latest Greg Hardy-gate and the subsequent ramblings of Jerry Jones are just a few of the reasons the Seahawks are facing a Dallas squad in disarray. The (Romo-less) Cowboys can’t throw it. They can’t stop anyone else from throwing it, and are also so-so at run defense. Fear of Marshawn Lynch will make them over-commit on the play action, and Russell Wilson will go 19-for-28 with 231 yards and two touchdowns. Go Hawks.</p>",
    "celebname": "Jason Finn",
    "celebbio": "Drummer, The Presidents of the United States of America",
    "celebclosest": "",
    "celeb2score": "",
    "celeb2commentary": "",
    "celeb2name": "",
    "celeb2bio": "",
    "celeb2closest": ""
  },
  {
    "title": "Week 7",
    "week": "Week 7",
    "date": "10/22 (Thursday)",
    "time": "5:25 p.m.",
    "location": "San Francisco",
    "finalwinner": "Seahawks 20",
    "finalloser": "49ers 3",
    "ot": "",
    "condottascore": "23-13 Seahawks",
    "condottacommentary": "<p>This looks like a make-or-break game for both teams, and the home 49ers appear to have righted the ship a little after a few tough games, beating the Ravens on Sunday. The 49ers still boast a front seven that could give the Seahawks fits. But Seattle has always been able to keep Colin Kaepernick in check, and the fourth-quarter worm has to turn eventually. Seattle will hold on for a much-needed win.</p>",
    "condottaclosest": "",
    "jenksscore": "24-10 Seahawks",
    "jenkscommentary": "<p>At some point it seems like the Seahawks have to put together a full four quarters ... doesn't it? The 49ers have played better of late, but they're still a team the Seahawks should take care of.</p>",
    "jenksclosest": "",
    "stonescore": "27-10 Seahawks",
    "stonecommentary": "<p>With all the talk about the Seahawks' inability to finish out games, they won't let up this time against a 49ers team that's not as formidable as in years past. On the other hand, the 49ers are playing better of late and realize a win over the Seahawks could transform their season. But the Seahawks are just as motivated, and more talented.</p>",
    "stoneclosest": "",
    "calkinsscore": "23-20 49ers",
    "calkinscommentary": "<p>The talent disparity would appear to favor Seattle heavily, but the Seahawks haven't proven much this year &mdash; especially on the road. Until they can get a win away from CenturyLink Field, I'm going to take the team they're up against.</p>",
    "calkinsclosest": "",
    "celebscore": "24-7 Seahawks",
    "celebcommentary": "<p>The Seahawks know it's serious at this point and won't lose any more games when they lead in the fourth quarter. Go Hawks!</p>",
    "celebname": "Ethan Stowell",
    "celebbio": "Seattle restaurateur",
    "celebclosest": "x",
    "celeb2score": "",
    "celeb2commentary": "",
    "celeb2name": "",
    "celeb2bio": "",
    "celeb2closest": ""
  },
  {
    "title": "Week 6",
    "week": "Week 6",
    "date": "10/18 (Sunday)",
    "time": "1:05 p.m.",
    "location": "Seattle",
    "finalwinner": "Panthers 27",
    "finalloser": "Seahawks 23",
    "ot": "",
    "condottascore": "21-17 Seahawks",
    "condottacommentary": "<p>Just about a must-win for the Seahawks. For all the recent doom and gloom, Seattle is 24-2 at home in the Russell Wilson era, and while the Panthers are dangerous, they have feasted on a weak schedule so far. The Seahawks will again make the key plays down the stretch to beat the Panthers for a fourth-straight year in the regular season.</p>",
    "condottaclosest": "",
    "jenksscore": "27-17 Seahawks",
    "jenkscommentary": "<p>The Panthers have been one of the surprises of the NFL so far, but a Seahawks team in desperate need of a win will close it out this time in the fourth quarter.</p>",
    "jenksclosest": "",
    "stonescore": "24-21 Seahawks",
    "stonecommentary": "<p>The Seahawks aren't going to let another lead slip away &mdash; not at home, anyway. They are in as close to a must-win scenario as you can get in Week 6, and the Seahawks will prevail against a team they have always figured out how to beat.</p>",
    "stoneclosest": "",
    "calkinsscore": "17-14 Seahawks",
    "calkinscommentary": "<p>The Panthers may be 4-0, but the wins have come against teams that are a combined 5-15. Given the importance of Sunday's game for Seattle, the Seahawks will sneak by a Carolina squad whose record overstates its ability.</p>",
    "calkinsclosest": "",
    "celebscore": "20-13 Seahawks",
    "celebcommentary": "<p>It's a critical home game against the undefeated Carolina Panthers &mdash; a season-defining moment for a Seattle team that has a history of seizing opportunity and rising to the occasion when their backs are up against the wall. This week it'll be QB Cam Newton with his back against the ground &mdash; Kam-slammed by the Seahawks defense &mdash; while the Seattle offense starts finding its rhythm.</p>",
    "celebname": "Kevin Cole",
    "celebbio": "Host of KEXP's 'The Afternoon Show'",
    "celebclosest": "",
    "celeb2score": "",
    "celeb2commentary": "",
    "celeb2name": "",
    "celeb2bio": "",
    "celeb2closest": ""
  },
  {
    "title": "Week 5",
    "week": "Week 5",
    "date": "10/11 (Sunday)",
    "time": "10 a.m.",
    "location": "Cincinnati",
    "finalwinner": "Bengals 27",
    "finalloser": "Seahawks 24",
    "ot": "x",
    "condottascore": "21-16 Bengals",
    "condottacommentary": "<p>After playing a rugged Monday night game, the Seahawks now have a short week and a long trip to play one of the hottest teams in the NFL. Seattle will be the best team the Bengals have played so far, and Cincy could be due for a slipup after a 4-0 start. But all the logical signs point to a close win for the home team.</p>",
    "condottaclosest": "",
    "jenksscore": "24-21 Bengals",
    "jenkscommentary": "<p>The problems along the offensive line will catch up with the Seahawks against a much improved Cincinnati team.</p>",
    "jenksclosest": "x",
    "stonescore": "24-17 Bengals",
    "stonecommentary": "<p>Going on the road to face the NFL's best offense &mdash; and its ninth-ranked scoring defense &mdash; will be too daunting a task for a Seahawks team still struggling to get its own offense in order.</p>",
    "stoneclosest": "",
    "calkinsscore": "21-14 Bengals",
    "calkinscommentary": "<p>Seattle's offense remains unproven and won't be able to keep up with the scoring machine that is the Bengals.</p>",
    "calkinsclosest": "",
    "celebscore": "30-20 Bengals",
    "celebcommentary": "<p>It pains me to say it: Cincinnati is firing on all cylinders, and the Hawks are still struggling. Winnable, but if Marshawn is out, the Hawks will have to step it way up on the road. And when I say \"step it up,\" I mean, in particular, the offensive line has to find a way to protect Russell Wilson. You can't have your star QB scrambling for his life on every play.</p>",
    "celebname": "Dow Constantine",
    "celebbio": "King County Executive",
    "celebclosest": "",
    "celeb2score": "",
    "celeb2commentary": "",
    "celeb2name": "",
    "celeb2bio": "",
    "celeb2closest": ""
  },
  {
    "title": "Week 4",
    "week": "Week 4",
    "date": "10/5 (Monday)",
    "time": "5:30 p.m.",
    "location": "Seattle",
    "finalwinner": "Seahawks 13",
    "finalloser": "Lions 10",
    "ot": "",
    "condottascore": "27-13 Seahawks",
    "condottacommentary": "<p>Detroit has Calvin Johnson, Golden Tate and Matt Stafford, and that should make for an exciting moment or two. But the Lions also can't run the ball and their defense is nowhere near as imposing as it was last season. Don't be surprised if the game is close for a while. But the Seahawks should again find their offensive bearings in the second half of the game.</p>",
    "condottaclosest": "",
    "jenksscore": "31-14 Seahawks",
    "jenkscommentary": "<p>The Seahawks' defense will get a better test from Detroit this week, but they showed enough signs last week against the Bears to believe they may be rounding back into form.</p>",
    "jenksclosest": "",
    "stonescore": "37-10 Seahawks",
    "stonecommentary": "<p>The Seahawks will put together their most complete game yet against the winless Lions. Bonus points if Marshawn Lynch plays, but rookie Thomas Rawls showed last week he's a capable replacement — and the Russell Wilson-Jimmy Graham connection will only get better.</p>",
    "stoneclosest": "",
    "calkinsscore": "21-17 Seahawks",
    "calkinscommentary": "<p>Detroit's offense, fueled by desperation, will put some points on the board, but the Seahawks' talent will ultimately prevail in front of their home crowd.</p>",
    "calkinsclosest": "x",
    "celebscore": "36-10 Seahawks",
    "celebcommentary": "<p>Seahawks in total destruction. They are finally on a roll with the majority of their key players healthy and ready to go. If Marshawn heals up, I'd bring a note from my mom and call in sick if I played for Detroit. Seriously. I would.</p>",
    "celebname": "Jesse Jones",
    "celebbio": "AKA 'Get Jesse,' KIRO 7 reporter",
    "celebclosest": "",
    "celeb2score": "",
    "celeb2commentary": "",
    "celeb2name": "",
    "celeb2bio": "",
    "celeb2closest": ""
  },
  {
    "title": "Week 3",
    "week": "Week 3",
    "date": "9/27 (Sunday)",
    "time": "1:25 p.m.",
    "location": "Seattle",
    "finalwinner": "Seahawks 26",
    "finalloser": "Bears 0",
    "ot": "",
    "condottascore": "38-13 Seahawks",
    "condottacommentary": "<p>Combine the return of Kam Chancellor with a visit from one of the worst teams in the NFL and the result should be a feel-good win to cap a feel-good week at the VMAC. Chicago is likely to go with Jimmy Clausen at quarterback and the Seattle defense could have a breakout game in forcing turnovers to set up some easy scores.</p>",
    "condottaclosest": "",
    "jenksscore": "31-17 Seahawks",
    "jenkscommentary": "<p>The Seahawks have some issues to sort out on defense and they have to figure out how to get the most out of tight end Jimmy Graham. But the Bears are a good remedy for those problems.</p>",
    "jenksclosest": "",
    "stonescore": "35-7 Seahawks",
    "stonecommentary": "<p>With Kam Chancellor back in fold and the home crowd behind them, the Seahawks will vent the frustration from their two losses by taking it out on the hapless Bears. Look for Jimmy Graham to have a breakout game.</p>",
    "stoneclosest": "",
    "calkinsscore": "24-7 Seahawks",
    "calkinscommentary": "<p>The Seahawks are motivated, have the home fans behind them and are as close to full-strength as they've ever been. Expect Chicago to bear the brunt of the Hawks' frustration.</p>",
    "calkinsclosest": "x",
    "celebscore": "34-13 Seahawks",
    "celebcommentary": "<p>Because it's the Seahawks' home opener, because Jay Cutler's out, because the Hawks should get points on turnovers against the Bears.</p>",
    "celebname": "Margaret Larson",
    "celebbio": "Host of KING 5's 'New Day Northwest'",
    "celebclosest": "",
    "celeb2score": "",
    "celeb2commentary": "",
    "celeb2name": "",
    "celeb2bio": "",
    "celeb2closest": ""
  },
  {
    "title": "Week 2",
    "week": "Week 2",
    "date": "9/20 (Sunday)",
    "time": "5:30 p.m.",
    "location": "Green Bay",
    "finalwinner": "Packers 27",
    "finalloser": "Seahawks 17",
    "ot": "",
    "condottascore": "27-23 Packers",
    "condottacommentary": "<p>The third meeting between the two teams in roughly a year will see the Packers getting a measure of revenge for their two defeats in Seattle last season. Aaron Rodgers will make a big play at a key time against a secondary still missing Kam Chancellor.</p>",
    "condottaclosest": "",
    "jenksscore": "24-23 Seahawks",
    "jenkscommentary": "<p>The Seahawks have been defined by their resiliency the last three years, and until they show they don't deserve otherwise, I'm going to give them the bounce-back benefit of the doubt.</p>",
    "jenksclosest": "",
    "stonescore": "28-21 Packers",
    "stonecommentary": "<p>Going into Lambeau Field against a highly motivated Packers team is simply too big a hurdle, though the Seahawks will take it to the wire. Last week's opener in St. Louis showed many areas of vulnerability for Seattle, and the Packers have the talent and experience to exploit them.</p>",
    "stoneclosest": "x",
    "calkinsscore": "28-24 Seahawks",
    "calkinscommentary": "<p>Not only are the Seahawks facing the prospect of falling to 0-2 for the first time in four years, they are facing a Packers team sans Jordy Nelson and Sam Barrington. Dangerous as Green Bay is, Seattle is still fraught with talent and has (moderate) desperation on its side.</p>",
    "calkinsclosest": "",
    "celebscore": "31-21 Packers",
    "celebcommentary": "<p>I want to predict a Seahawks win for our Seattle fans. And I hope they do beat the Green Bay Packers because I don't like the Green Bay Packers. But I don't think it's gonna happen. I don't think they're going to see their first win until Week 3.</p>",
    "celebname": "Chad Barrett",
    "celebbio": "Sounders FC forward",
    "celebclosest": "",
    "celeb2score": "",
    "celeb2commentary": "",
    "celeb2name": "",
    "celeb2bio": "",
    "celeb2closest": ""
  },
  {
    "title": "Week 1",
    "week": "Week 1",
    "date": "9/13 (Sunday)",
    "time": "10 a.m.",
    "location": "St. Louis",
    "finalwinner": "Rams 34",
    "finalloser": "Seahawks 31",
    "ot": "x",
    "condottascore": "16-13 Seahawks",
    "condottacommentary": "<p>Seattle's games in St. Louis are rarely easy and the Rams have won two of the last three there against the Seahawks. But despite an untested offensive line and some uncertainty in the secondary, the Seahawks are still simply the better team and should figure out a way to get it done.</p>",
    "condottaclosest": "",
    "jenksscore": "21-13 Seahawks",
    "jenkscommentary": "<p>The offensive line will struggle with the Rams' lethal defensive line, but the combination of Jimmy Graham, Marshawn Lynch and Russell Wilson will be enough to overcome it.</p>",
    "jenksclosest": "",
    "stonescore": "20-17 Rams",
    "stonecommentary": "<p>St. Louis has always been an inhospitable place for the Seahawks, and despite the Rams' lame-duck status and an expected small crowd, I see them pulling out a squeaker. The difference maker will be St. Louis' outstanding defensive line, anchored by Chris Long and Robert Quinn, against a still-developing Seahawks offensive line.</p>",
    "stoneclosest": "x",
    "calkinsscore": "17-14 Seahawks",
    "calkinscommentary": "<p>A shaky offensive line and presumed absence of Kam Chancellor will make this a difficult win to come by, but the Seahawks still have a top-tier defense and enough offensive firepower to slip by St. Louis on the road.</p>",
    "calkinsclosest": "",
    "celebscore": "70-0 Seahawks",
    "celebcommentary": "<p>It's going to be a very physical football game. Both teams have tremendous defenses. ... Seahawks are going to win. It's going to be close, but they'll pull it out.</p>",
    "celebname": "Curt Warner",
    "celebbio": "Seahawks running back, 1983-89",
    "celebclosest": "",
    "celeb2score": "",
    "celeb2commentary": "",
    "celeb2name": "",
    "celeb2bio": "",
    "celeb2closest": ""
  }
]